_posts/2019-09-17-automatically-update-publications-with-R-scholar-II-get-pdf.html
---
layout: post
class: post-template
title: "Automatically update your publication list using R scholar II - get a PDF"
author: thackl
cover: img/google-scholar-books-pdf.png
---

<p>
<a href="http://alecri.github.io/">Alessio</a> apparently read my blog post on <a href="https://thackl.github.io/automatically-update-publications-with-R-scholar">how to automatically update your
publication list using R and google scholar</a>. He contacted me wondering if there
is also a solution to get a PDF. Good question, thanks!
</p>

<p>
There are probably a few ways to get a PDF. Fancy ones might include the use of
<a href="https://yihui.name/knitr/">knitr</a> or the great <a href="https://pandoc.org/">pandoc</a> converter, likely involving a intermediate TEX file or
so. Here, however, I tried to aim for a fast and straight-forward workaround.
</p>

<p>
Let us assume we already have a HTML version of our publication list, for
example, obtained as described in the post mentioned above. Converting HTML to
PDF can be a bit of a nightmare, particularly if you want to maintain the CSS
style of your website. What works for me is to use the Google Chrome API
function <code>chrome_print</code> of the R package <a href="https://github.com/rstudio/pagedown">pagedown</a>. It is not very flexible, but
you pretty much get what you already have on the HTML page in your PDF - with a
single command. The only requirement, you need to have Google Chrome installed.
</p>

<p>
Here is my <a href="https://thackl.github.io/assets/publications.pdf">publication list as PDF</a>.
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #a2cd5a;">library</span>(pagedown)

chrome_print(
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">link to my publication list w/o header/footer in html</span>
  <span style="color: #deb887;">"https://thackl.github.io/publications-clean"</span>,
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">the pdf to generate</span>
  <span style="color: #deb887;">"publications.pdf"</span>
)
</pre>
</div>
